Repository: ai-rafat/crossword_puzzle
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ug, yi

source: Crossword Puzzle
yi: קראָסווערד רעטעניש

source: View crosswords
ug: ھالقىلىق سۆزنى كۆرۈش
yi: View קראָסווערדז

source: Exit the app
ug: ئەپتىن چىقىڭ
yi: אַרויסגאַנג די אַפּ

source: Global Settings
yi: גלאבאלע סעטטינגס

source: Languages
ug: تىللار
yi: שפּראַכן

source: Size
ug: چوڭلۇقى
yi: גרייס

source: light
ug: نۇر
yi: ליכט

source: dark
ug: قاراڭغۇ
yi: טונקל

source: system
ug: سىستېما
yi: סיסטעם

source: Appearance
ug: كۆرۈنۈش
yi: אויסזען

source: Crossword Browser
ug: Crossword توركۆرگۈ
yi: קראָסווערד בראַוזער

source: Go back
ug: قايتىڭ
yi: גיי צוריק

source: Load crossword
ug: ھالقىلىق سۆزنى يۈكلەڭ
yi: מאַסע קראָסווערד

source: Open web app
ug: تور دېتالىنى ئېچىڭ
yi: עפֿענען וועב אַפּ

source: Terminate web app
ug: تور دېتالىنى ئاخىرلاشتۇرۇڭ
yi: פאַרענדיקן די וועב אַפּ

source: Word count preferences
ug: سۆز ساناش مايىللىقى
yi: וואָרט ציילן פּרעפֿערענצן

source: Select word count
ug: سۆز سانىنى تاللاڭ
yi: אויסקלייַבן וואָרט ציילן

source: Maximum
ug: ئەڭ چوڭ
yi: מאַקסימום

source: Custom
yi: מנהג

source: Close
ug: تاقاش
yi: נאָענט

source: Total words
ug: ئومۇمىي سۆز
yi: גאַנץ ווערטער

source: Difficulty
ug: قىيىن
yi: שוועריקייט

source: difficulty
ug: قىيىنچىلىق
yi: שוועריקייט

source: Select
ug: تاللاڭ
yi: אויסקלייַבן

source: Restart
ug: قايتا قوزغىتىڭ
yi: הייב אן נאכאמאל

source: Are you sure you want to restart the app?
ug: بۇ ئەپنى قايتا قوزغىتىشنى خالامسىز؟
yi: זענט איר זיכער אַז איר ווילן צו ריסטאַרט די אַפּ?

source: Exit
ug: چىقىش
yi: אַרויסגאַנג

source: Are you sure you want to exit the app? If the web app is running, it will be terminated.
ug: بۇ دېتالدىن چېكىنىشنى خالامسىز؟ ئەگەر تور دېتالى ئىجرا بولۇۋاتقان بولسا ، ئۇ ئاخىرلىشىدۇ.
yi: זענט איר זיכער אַז איר ווילן צו אַרויסגאַנג די אַפּ? אויב די וועב אַפּ איז פליסנדיק, עס וועט זיין טערמאַנייטיד.

source: Back to home
ug: ئۆيگە قايتىش
yi: צוריק אהיים

source: Are you sure you want to go back to the home screen? The web app will be terminated.
ug: باش ئېكرانغا قايتىشنى خالامسىز؟ تور ئەپلىرى توختىتىلىدۇ.
yi: זענט איר זיכער אַז איר ווילן צו גיין צוריק צו די היים פאַרשטעלן? די וועב אַפּ וועט זיין טערמאַנייטיד.

source: Error
ug: خاتالىق
yi: טעות

source: This language is already selected.
ug: بۇ تىل ئاللىقاچان تاللانغان.
yi: די שפּראַך איז שוין אויסגעקליבן.

source: This size is already selected.
ug: بۇ چوڭلۇق ئاللىقاچان تاللانغان.
yi: די גרייס איז שוין אויסגעקליבן.

source: This appearance is already selected.
ug: بۇ كۆرۈنۈش ئاللىقاچان تاللانغان.
yi: דעם אויסזען איז שוין אויסגעקליבן.

source: Info
ug: ئۇچۇر
yi: אינפֿאָרמאַציע

source: First time launch, please read: Once you have loaded a crossword, and wish to load another one, you must first terminate the web app. IMPORTANT: If you are on macOS, force quitting the application (using cmd+q) while the web app is running will prevent it from properly terminating. If you mistakenly do this, either find the Flask app process and terminate it, change the `webapp_port` number in src/config.ini, or restart your computer. ALSO IMPORTANT: In some cases, you may have launched the web app yet your browser cannot view it. If this happens, please restart your browser.
ug: تۇنجى قېتىم قوزغىتىش ، ئوقۇپ بېقىڭ: بىر ھالقىلىق سۆزنى يۈكلەپ ، يەنە بىرنى يۈكلىمەكچى بولسىڭىز ، ئالدى بىلەن تور دېتالىنى ئاخىرلاشتۇرۇشىڭىز كېرەك. مۇھىمى: ئەگەر سىز macOS دە بولسىڭىز ، تور دېتالى ئىجرا بولۇۋاتقاندا پروگراممىنى (cmd + q ئىشلىتىپ) زور كۈچ بىلەن تاشلاشنىڭ ئالدىنى ئالىدۇ. ئەگەر خاتا ھالدا بۇ ئىشنى قىلسىڭىز ، ياكى Flask ئەپ جەريانىنى تېپىپ ئاخىرلاشتۇرۇڭ ، src / config.ini دىكى `webapp_port` نومۇرىنى ئۆزگەرتىڭ ياكى كومپيۇتېرىڭىزنى قايتا قوزغىتىڭ. مۇھىم: بەزى ئەھۋاللاردا ، سىز تور ئەپنى ئاچقان بولۇشىڭىز مۇمكىن ، لېكىن تور كۆرگۈچىڭىز ئۇنى كۆرەلمەيدۇ. ئەگەر بۇ خىل ئەھۋال كۆرۈلسە ، تور كۆرگۈچىڭىزنى قايتا قوزغىتىڭ.
yi: ערשטער מאָל קאַטער, ביטע לייענען: אַמאָל איר האָבן לאָודיד אַ קראָסווערד און איר ווילן צו לאָדן אן אנדער איינער, איר מוזן ערשטער פאַרענדיקן די וועב אַפּ. וויכטיק: אויב איר זענט אויף macOS, צווינגען פאַרלאָזן די אַפּלאַקיישאַן (ניצן cmd + q) בשעת די וועב אַפּ איז פליסנדיק וועט פאַרמייַדן עס פון רעכט טערמאַנייטינג. אויב איר טעות טאָן דאָס, געפֿינען די פלאַסק אַפּ פּראָצעס און פאַרענדיקן עס, טוישן די 'webapp_port' נומער אין src/config.ini אָדער ריסטאַרט דיין קאָמפּיוטער. אויך וויכטיק: אין עטלעכע קאַסעס, איר קען האָבן לאָנטשט די וועב אַפּ, אָבער דיין בלעטערער קען נישט זען עס. אויב דאָס כאַפּאַנז, ביטע ריסטאַרט דיין בלעטערער.

source: Crossword Puzzle - Game
ug: ھالقىلىق سۆز تېپىشمىسى - ئويۇن
yi: קראָסווערד רעטעניש - שפּיל

source: Across
yi: אַריבער

source: Down
ug: تۆۋەنگە
yi: אַראָפּ

source: You completed the crossword!
ug: ھالقىلىق سۆزنى تاماملىدىڭىز!
yi: איר האָט געענדיקט די קראָסווערד!

source: Easy
ug: ئاسان
yi: גרינג

source: Medium
ug: ئوتتۇراھال
yi: מיטל

source: Hard
ug: قاتتىق
yi: שווער

source: Extreme
ug: ھەددىدىن ئاشقان
yi: עקסטרעם

source: Geography
ug: جۇغراپىيە
yi: געאָגראַפי

source: View
ug: كۆرۈش
